fubingyan2026/stm32_workspace_/stm32_G474/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VBAT2_EN_Pin GPIO_PIN_13
#define VBAT2_EN_GPIO_Port GPIOC
#define VBAT1_ADC_Pin GPIO_PIN_0
#define VBAT1_ADC_GPIO_Port GPIOC
#define V_CHARGE_ADC_Pin GPIO_PIN_1
#define V_CHARGE_ADC_GPIO_Port GPIOC
#define VBAT2_ADC_Pin GPIO_PIN_2
#define VBAT2_ADC_GPIO_Port GPIOC
#define NTC2_ADC_Pin GPIO_PIN_3
#define NTC2_ADC_GPIO_Port GPIOC
#define BUZZ_Pin GPIO_PIN_0
#define BUZZ_GPIO_Port GPIOA
#define VOUT_ADC_Pin GPIO_PIN_1
#define VOUT_ADC_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_2
#define LED_GPIO_Port GPIOA
#define KEY1_IN_IO_Pin GPIO_PIN_3
#define KEY1_IN_IO_GPIO_Port GPIOA
#define D_IN2_IO_Pin GPIO_PIN_4
#define D_IN2_IO_GPIO_Port GPIOA
#define RELAY1_IN_Pin GPIO_PIN_5
#define RELAY1_IN_GPIO_Port GPIOA
#define RELAY3_IN_Pin GPIO_PIN_6
#define RELAY3_IN_GPIO_Port GPIOA
#define RELAY2_IN_Pin GPIO_PIN_7
#define RELAY2_IN_GPIO_Port GPIOA
#define NTC1_ADC_Pin GPIO_PIN_11
#define NTC1_ADC_GPIO_Port GPIOB
#define KEY2_IN_IO_Pin GPIO_PIN_8
#define KEY2_IN_IO_GPIO_Port GPIOC
#define D_IN1_IO_Pin GPIO_PIN_9
#define D_IN1_IO_GPIO_Port GPIOC
#define PRECHARGE_EN_Pin GPIO_PIN_8
#define PRECHARGE_EN_GPIO_Port GPIOA
#define KEY_LED_IN_Pin GPIO_PIN_9
#define KEY_LED_IN_GPIO_Port GPIOA
#define POWER_CAN_STB_Pin GPIO_PIN_10
#define POWER_CAN_STB_GPIO_Port GPIOA
#define POWER_CAN_RXD_Pin GPIO_PIN_11
#define POWER_CAN_RXD_GPIO_Port GPIOA
#define POWER_CAN_TXD_Pin GPIO_PIN_12
#define POWER_CAN_TXD_GPIO_Port GPIOA
#define V_CHARGE_VBAT1_EN_Pin GPIO_PIN_15
#define V_CHARGE_VBAT1_EN_GPIO_Port GPIOA
#define VBAT1_EN_Pin GPIO_PIN_10
#define VBAT1_EN_GPIO_Port GPIOC
#define VBAT1_PGD_Pin GPIO_PIN_11
#define VBAT1_PGD_GPIO_Port GPIOC
#define VBAT2_PGD_Pin GPIO_PIN_12
#define VBAT2_PGD_GPIO_Port GPIOC
#define BAT1_CAN_STB_Pin GPIO_PIN_2
#define BAT1_CAN_STB_GPIO_Port GPIOD
#define BAT1_CAN_RXD_Pin GPIO_PIN_3
#define BAT1_CAN_RXD_GPIO_Port GPIOB
#define BAT1_CAN_TXD_Pin GPIO_PIN_4
#define BAT1_CAN_TXD_GPIO_Port GPIOB
#define BAT2_CAN_RXD_Pin GPIO_PIN_5
#define BAT2_CAN_RXD_GPIO_Port GPIOB
#define BAT2_CAN_TXD_Pin GPIO_PIN_6
#define BAT2_CAN_TXD_GPIO_Port GPIOB
#define BAT2_CAN_STB_Pin GPIO_PIN_7
#define BAT2_CAN_STB_GPIO_Port GPIOB
#define V_CHARGE_VBAT2_EN_Pin GPIO_PIN_9
#define V_CHARGE_VBAT2_EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
